Revit 2024 API
FabricationPart.GetProductListEntryCount Method
 Gets the number of product entries for this part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016 Subscription Release
Syntax
C#
public int GetProductListEntryCount()
Visual Basic
Public Function GetProductListEntryCount As Integer
Visual C++
public:
int GetProductListEntryCount()
Return Value
 Returns the number of product entries.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace